Autodesk.Revit.DB.DirectShapeReferenceOptions.GetExternalGeometryId
Retrieves the ExternalGeometryId associated with the reference object.
Remarks:
If an ExternalGeometryId has not been set, this method returns null.
Since:
2024

Autodesk.Revit.DB.DirectShapeReferenceOptions.SetExternalGeometryId(Autodesk.Revit.DB.ExternalGeometryId)
Sets the ExternalGeometryId associated with the reference object.
The ID must be non-empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
externalId cannot be used as an ExternalGeometryId for a direct shape reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeReferenceOptions.IsValidExternalGeometryId(Autodesk.Revit.DB.ExternalGeometryId)
Validates that the input ExternalGeometryId can be assigned to a direct shape reference.
externalId:
The ExternalGeometryId to assign to the reference.
Returns:
True if the provided ExternalGeometryId is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeReferenceOptions.IsValidReferenceName(System.String)
Validates that the input name can be assigned to a direct shape reference.
name:
The name to assign to the reference.
Returns:
True if the input name is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeReferenceOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectShapeReferenceOptions.Name
The name associated with the reference object.
The name does not need to be unique.
The name must not be empty and must contain valid characters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: value cannot be used as a name for the direct shape reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor
Constructs a new DirectShapeRefOptions instance with default settings.
Since:
2022

Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor(Autodesk.Revit.DB.DirectShapeReferenceOptions)
Constructs a new copy of the input DirectShapeRefOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeReferenceOptions
This class is used to control the behavior of DirectShape and DirectShapeType reference objects.
Since:
2022